// Расчет x-го числа Фиббоначчи
Функция fib(x)
  Если x < 3 Тогда
    Возврат 1;
  Иначе
    Возврат fib(x-1)+fib(x-2);
  КонецЕсли;
КонецФункции

// Это выражение расчитывает 40-е число.
Сообщить(fib(40))

//
//ТестовыйМассив = Новый Массив;
//ТестовыйМассив.Добавить(1);
//ТестовыйМассив.Добавить(2);
//ТестовыйМассив.Добавить(3);
//ТестовыйМассив.Добавить(4);
//
//мЗначение = 0;
//
//Для Каждого мЗначение Из ТестовыйМассив Цикл
//
//	Если мЗначение = 3 Тогда
//		Прервать;
//	КонецЕсли;
//
//КонецЦикла;
//
//Сообщить(мЗначение);

